var $lang={
errAlertMsg: "Нет законного формат дат не ограничивать или дата диапазон, нужно отменить?",
aWeekStr: ["недели","Вс","Пн","Вт","Ср","Чт","Пт","Сб"],
aLongWeekStr:["недели","воскресенье","Понедельник","вторник","среда","четверг","пятница","суббота"],
aMonStr: ["Январь","Февраль","Март","Апрель","Май","Июнь","Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь"],
aLongMonStr: ["Январь","Февраль","Март","Апрель","Май","Июнь","Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь"],
clearStr: "Очистить",
todayStr: "сегодня",
okStr: "Ok",
updateStr: "Ok",
timeStr: "Время",
quickStr: "Быстро выбрать", 
err_1: 'Минимальный дата не превышает максимально дата!'
}