/******************************************************************************
	Copyright (C), 2008-2018, JABSCO ELECTRONIC Tech. Co., Ltd

	File Name	: libsecurity.h
	Version		: 1.0
	Author		: JABSCO Video Server Software Group
	Created		: 2015.04.24
	Description	: 
	History		:
					Create by tianjun 2015.04.24
******************************************************************************/
#ifndef __JABSCO_LIB_SECURITY_H__
#define __JABSCO_LIB_SECURITY_H__

#ifdef __cplusplus
extern "C" {
#endif


/****************************************************************************
 *   ret = 0 表示加密检查成功
 *   其他值  表示加密检查失败
 ***************************************************************************/
int security_is_ok(void);

/****************************************************************************
 *   ret = 0 表示得到设备的ID成功
 *   其他值  表示得到设备的ID失败
 *   ID 是 11 byte 数据值
 ***************************************************************************/
int security_get_id(unsigned char *pSerial);


/****************************************************************************
 *   ret = 0 表示写入设备的ID成功
 *   其他值  表示写入设备的ID失败
 *   ID 是 11 byte 数据值
 ***************************************************************************/
int security_set_id(unsigned char *pSerial);



/****************************************************************************
 *   ret = 0 表示得到设备的ID成功
 *   其他值  表示得到设备的ID失败
 *   ID 是24 byte 数据值
 ***************************************************************************/
int gd25q_get_id(unsigned char *pID);

#ifdef __cplusplus
}

#endif

#endif


